espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_smu.h
/* Bit fields for SMU PPUNSFS */
#define _SMU_PPUNSFS_RESETVALUE                    0x00000000UL                              /**< Default value for SMU_PPUNSFS               */
#define _SMU_PPUNSFS_MASK                          0x000000FFUL                              /**< Mask for SMU_PPUNSFS                        */
#define _SMU_PPUNSFS_PPUFSPERIPHID_SHIFT           0                                         /**< Shift value for SMU_PPUFSPERIPHID           */
#define _SMU_PPUNSFS_PPUFSPERIPHID_MASK            0xFFUL                                    /**< Bit mask for SMU_PPUFSPERIPHID              */
#define _SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT         0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSFS                */
#define SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT          (_SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_PPUNSFS        */

/* Bit fields for SMU BMPUNSPATD0 */
#define _SMU_BMPUNSPATD0_RESETVALUE                0x000003FFUL                                   /**< Default value for SMU_BMPUNSPATD0           */
#define _SMU_BMPUNSPATD0_MASK                      0x000003FFUL                                   /**< Mask for SMU_BMPUNSPATD0                    */
#define SMU_BMPUNSPATD0_RADIOAES                   (0x1UL << 0)                                   /**< RADIO AES DMA privileged mode               */
#define _SMU_BMPUNSPATD0_RADIOAES_SHIFT            0                                              /**< Shift value for SMU_RADIOAES                */
#define _SMU_BMPUNSPATD0_RADIOAES_MASK             0x1UL                                          /**< Bit mask for SMU_RADIOAES                   */
#define _SMU_BMPUNSPATD0_RADIOAES_DEFAULT          0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RADIOAES_DEFAULT           (_SMU_BMPUNSPATD0_RADIOAES_DEFAULT << 0)       /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_RADIOSUBSYSTEM             (0x1UL << 1)                                   /**< RADIO subsystem manager privileged mode     */
#define _SMU_BMPUNSPATD0_RADIOSUBSYSTEM_SHIFT      1                                              /**< Shift value for SMU_RADIOSUBSYSTEM          */
#define _SMU_BMPUNSPATD0_RADIOSUBSYSTEM_MASK       0x2UL                                          /**< Bit mask for SMU_RADIOSUBSYSTEM             */
#define _SMU_BMPUNSPATD0_RADIOSUBSYSTEM_DEFAULT    0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RADIOSUBSYSTEM_DEFAULT     (_SMU_BMPUNSPATD0_RADIOSUBSYSTEM_DEFAULT << 1) /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_BUFC                       (0x1UL << 2)                                   /**< BUFC privileged mode                        */
#define _SMU_BMPUNSPATD0_BUFC_SHIFT                2                                              /**< Shift value for SMU_BUFC                    */
#define _SMU_BMPUNSPATD0_BUFC_MASK                 0x4UL                                          /**< Bit mask for SMU_BUFC                       */
#define _SMU_BMPUNSPATD0_BUFC_DEFAULT              0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_BUFC_DEFAULT               (_SMU_BMPUNSPATD0_BUFC_DEFAULT << 2)           /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_LDMA0                      (0x1UL << 3)                                   /**< MCU LDMA port 0 privileged mode             */
#define _SMU_BMPUNSPATD0_LDMA0_SHIFT               3                                              /**< Shift value for SMU_LDMA0                   */
#define _SMU_BMPUNSPATD0_LDMA0_MASK                0x8UL                                          /**< Bit mask for SMU_LDMA0                      */
#define _SMU_BMPUNSPATD0_LDMA0_DEFAULT             0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_LDMA0_DEFAULT              (_SMU_BMPUNSPATD0_LDMA0_DEFAULT << 3)          /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_LDMA1                      (0x1UL << 4)                                   /**< MCU LDMA port 1 privileged mode             */
#define _SMU_BMPUNSPATD0_LDMA1_SHIFT               4                                              /**< Shift value for SMU_LDMA1                   */
#define _SMU_BMPUNSPATD0_LDMA1_MASK                0x10UL                                         /**< Bit mask for SMU_LDMA1                      */
#define _SMU_BMPUNSPATD0_LDMA1_DEFAULT             0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_LDMA1_DEFAULT              (_SMU_BMPUNSPATD0_LDMA1_DEFAULT << 4)          /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_RFECA0                     (0x1UL << 5)                                   /**< RFECA0 privileged mode                      */
#define _SMU_BMPUNSPATD0_RFECA0_SHIFT              5                                              /**< Shift value for SMU_RFECA0                  */
#define _SMU_BMPUNSPATD0_RFECA0_MASK               0x20UL                                         /**< Bit mask for SMU_RFECA0                     */
#define _SMU_BMPUNSPATD0_RFECA0_DEFAULT            0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RFECA0_DEFAULT             (_SMU_BMPUNSPATD0_RFECA0_DEFAULT << 5)         /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_RFECA1                     (0x1UL << 6)                                   /**< RFECA1 privileged mode                      */
#define _SMU_BMPUNSPATD0_RFECA1_SHIFT              6                                              /**< Shift value for SMU_RFECA1                  */
#define _SMU_BMPUNSPATD0_RFECA1_MASK               0x40UL                                         /**< Bit mask for SMU_RFECA1                     */
#define _SMU_BMPUNSPATD0_RFECA1_DEFAULT            0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RFECA1_DEFAULT             (_SMU_BMPUNSPATD0_RFECA1_DEFAULT << 6)         /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_RFLDMA                     (0x1UL << 7)                                   /**< RFLDMA privileged mode                      */
#define _SMU_BMPUNSPATD0_RFLDMA_SHIFT              7                                              /**< Shift value for SMU_RFLDMA                  */
#define _SMU_BMPUNSPATD0_RFLDMA_MASK               0x80UL                                         /**< Bit mask for SMU_RFLDMA                     */
#define _SMU_BMPUNSPATD0_RFLDMA_DEFAULT            0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_RFLDMA_DEFAULT             (_SMU_BMPUNSPATD0_RFLDMA_DEFAULT << 7)         /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_SEEXTDMA                   (0x1UL << 8)                                   /**< SEEXTDMA privileged mode                    */
#define _SMU_BMPUNSPATD0_SEEXTDMA_SHIFT            8                                              /**< Shift value for SMU_SEEXTDMA                */
#define _SMU_BMPUNSPATD0_SEEXTDMA_MASK             0x100UL                                        /**< Bit mask for SMU_SEEXTDMA                   */
#define _SMU_BMPUNSPATD0_SEEXTDMA_DEFAULT          0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_SEEXTDMA_DEFAULT           (_SMU_BMPUNSPATD0_SEEXTDMA_DEFAULT << 8)       /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_USB                        (0x1UL << 9)                                   /**< USB privileged mode                         */
#define _SMU_BMPUNSPATD0_USB_SHIFT                 9                                              /**< Shift value for SMU_USB                     */
#define _SMU_BMPUNSPATD0_USB_MASK                  0x200UL                                        /**< Bit mask for SMU_USB                        */
#define _SMU_BMPUNSPATD0_USB_DEFAULT               0x00000001UL                                   /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_USB_DEFAULT                (_SMU_BMPUNSPATD0_USB_DEFAULT << 9)            /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */

/** @} End of group EFR32FG25_SMU_CFGNS_BitFields */
/** @} End of group EFR32FG25_SMU_CFGNS */
/** @} End of group Parts */

#endif /* EFR32FG25_SMU_H */
